grevaillot/svd_tools/headers/ATSAMV71Q20/mcan0.h
/** @defgroup mcan0_mcan_fbtp MCANFBTP Fast Bit Timing and Prescaler Register
@{*/


#define MCAN0_MCAN_FBTP_TDCO_SHIFT		24
#define MCAN0_MCAN_FBTP_TDCO_MASK		0x1f
/** @defgroup mcan0_mcan_fbtp_tdco TDCO Transceiver Delay Compensation Offset
@{*/
/**@}*/

/** MCAN0_MCAN_FBTP_TDC Transceiver Delay Compensation **/
#define MCAN0_MCAN_FBTP_TDC		(1 << 23)

#define MCAN0_MCAN_FBTP_FBRP_SHIFT		16
#define MCAN0_MCAN_FBTP_FBRP_MASK		0x1f
/** @defgroup mcan0_mcan_fbtp_fbrp FBRP Fast Baud Rate Prescaler
@{*/
/**@}*/


#define MCAN0_MCAN_FBTP_FTSEG1_SHIFT		8
#define MCAN0_MCAN_FBTP_FTSEG1_MASK		0x0f
/** @defgroup mcan0_mcan_fbtp_ftseg1 FTSEG1 Fast Time Segment Before Sample Point
@{*/
/**@}*/


#define MCAN0_MCAN_FBTP_FTSEG2_SHIFT		4
#define MCAN0_MCAN_FBTP_FTSEG2_MASK		0x07
/** @defgroup mcan0_mcan_fbtp_ftseg2 FTSEG2 Fast Time Segment After Sample Point
@{*/
/**@}*/


#define MCAN0_MCAN_FBTP_FSJW_SHIFT		0
#define MCAN0_MCAN_FBTP_FSJW_MASK		0x03
/** @defgroup mcan0_mcan_fbtp_fsjw FSJW Fast (Re) Synchronization Jump Width
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_test MCANTEST Test Register
@{*/


#define MCAN0_MCAN_TEST_TDCV_SHIFT		8
#define MCAN0_MCAN_TEST_TDCV_MASK		0x3f
/** @defgroup mcan0_mcan_test_tdcv TDCV Transceiver Delay Compensation Value (read-only)
@{*/
/**@}*/

/** MCAN0_MCAN_TEST_RX Receive Pin (read-only) **/
#define MCAN0_MCAN_TEST_RX		(1 << 7)

#define MCAN0_MCAN_TEST_TX_SHIFT		5
#define MCAN0_MCAN_TEST_TX_MASK		0x03
/** @defgroup mcan0_mcan_test_tx TX Control of Transmit Pin (read/write)
@{*/
/**@}*/

/** MCAN0_MCAN_TEST_LBCK Loop Back Mode (read/write) **/
#define MCAN0_MCAN_TEST_LBCK		(1 << 4)

/**@}*/

/** @defgroup mcan0_mcan_rwd MCANRWD RAM Watchdog Register
@{*/


#define MCAN0_MCAN_RWD_WDV_SHIFT		8
#define MCAN0_MCAN_RWD_WDV_MASK		0xff
/** @defgroup mcan0_mcan_rwd_wdv WDV Watchdog Value (read-only)
@{*/
/**@}*/


#define MCAN0_MCAN_RWD_WDC_SHIFT		0
#define MCAN0_MCAN_RWD_WDC_MASK		0xff
/** @defgroup mcan0_mcan_rwd_wdc WDC Watchdog Configuration (read/write)
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_cccr MCANCCCR CC Control Register
@{*/

/** MCAN0_MCAN_CCCR_TXP Transmit Pause (read/write, write protection) **/
#define MCAN0_MCAN_CCCR_TXP		(1 << 14)
/** MCAN0_MCAN_CCCR_FDBS CAN FD Bit Rate Switching (read-only) **/
#define MCAN0_MCAN_CCCR_FDBS		(1 << 13)
/** MCAN0_MCAN_CCCR_FDO CAN FD Operation (read-only) **/
#define MCAN0_MCAN_CCCR_FDO		(1 << 12)

#define MCAN0_MCAN_CCCR_CMR_SHIFT		10
#define MCAN0_MCAN_CCCR_CMR_MASK		0x03
/** @defgroup mcan0_mcan_cccr_cmr CMR CAN Mode Request (read/write)
@{*/
/**@}*/


#define MCAN0_MCAN_CCCR_CME_SHIFT		8
#define MCAN0_MCAN_CCCR_CME_MASK		0x03
/** @defgroup mcan0_mcan_cccr_cme CME CAN Mode Enable (read/write, write protection)
@{*/
/**@}*/

/** MCAN0_MCAN_CCCR_TEST Test Mode Enable (read/write, write protection against '1') **/
#define MCAN0_MCAN_CCCR_TEST		(1 << 7)
/** MCAN0_MCAN_CCCR_DAR Disable Automatic Retransmission (read/write, write protection) **/
#define MCAN0_MCAN_CCCR_DAR		(1 << 6)
/** MCAN0_MCAN_CCCR_MON Bus Monitoring Mode (read/write, write protection against '1') **/
#define MCAN0_MCAN_CCCR_MON		(1 << 5)
/** MCAN0_MCAN_CCCR_CSR Clock Stop Request (read/write) **/
#define MCAN0_MCAN_CCCR_CSR		(1 << 4)
/** MCAN0_MCAN_CCCR_CSA Clock Stop Acknowledge (read-only) **/
#define MCAN0_MCAN_CCCR_CSA		(1 << 3)
/** MCAN0_MCAN_CCCR_ASM Restricted Operation Mode (read/write, write protection against '1') **/
#define MCAN0_MCAN_CCCR_ASM		(1 << 2)
/** MCAN0_MCAN_CCCR_CCE Configuration Change Enable (read/write, write protection) **/
#define MCAN0_MCAN_CCCR_CCE		(1 << 1)
/** MCAN0_MCAN_CCCR_INIT Initialization (read/write) **/
#define MCAN0_MCAN_CCCR_INIT		(1 << 0)

/**@}*/

/** @defgroup mcan0_mcan_btp MCANBTP Bit Timing and Prescaler Register
@{*/


#define MCAN0_MCAN_BTP_BRP_SHIFT		16
#define MCAN0_MCAN_BTP_BRP_MASK		0x3ff
/** @defgroup mcan0_mcan_btp_brp BRP Baud Rate Prescaler
@{*/
/**@}*/


#define MCAN0_MCAN_BTP_TSEG1_SHIFT		8
#define MCAN0_MCAN_BTP_TSEG1_MASK		0x3f
/** @defgroup mcan0_mcan_btp_tseg1 TSEG1 Time Segment Before Sample Point
@{*/
/**@}*/


#define MCAN0_MCAN_BTP_TSEG2_SHIFT		4
#define MCAN0_MCAN_BTP_TSEG2_MASK		0x0f
/** @defgroup mcan0_mcan_btp_tseg2 TSEG2 Time Segment After Sample Point
@{*/
/**@}*/


#define MCAN0_MCAN_BTP_SJW_SHIFT		0
#define MCAN0_MCAN_BTP_SJW_MASK		0x0f
/** @defgroup mcan0_mcan_btp_sjw SJW (Re) Synchronization Jump Width
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_tscc MCANTSCC Timestamp Counter Configuration Register
@{*/


#define MCAN0_MCAN_TSCC_TCP_SHIFT		16
#define MCAN0_MCAN_TSCC_TCP_MASK		0x0f
/** @defgroup mcan0_mcan_tscc_tcp TCP Timestamp Counter Prescaler
@{*/
/**@}*/


#define MCAN0_MCAN_TSCC_TSS_SHIFT		0
#define MCAN0_MCAN_TSCC_TSS_MASK		0x03
/** @defgroup mcan0_mcan_tscc_tss TSS Timestamp Select
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_tscv MCANTSCV Timestamp Counter Value Register
@{*/


#define MCAN0_MCAN_TSCV_TSC_SHIFT		0
#define MCAN0_MCAN_TSCV_TSC_MASK		0xffff
/** @defgroup mcan0_mcan_tscv_tsc TSC Timestamp Counter (cleared on write)
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_tocc MCANTOCC Timeout Counter Configuration Register
@{*/


#define MCAN0_MCAN_TOCC_TOP_SHIFT		16
#define MCAN0_MCAN_TOCC_TOP_MASK		0xffff
/** @defgroup mcan0_mcan_tocc_top TOP Timeout Period
@{*/
/**@}*/


#define MCAN0_MCAN_TOCC_TOS_SHIFT		1
#define MCAN0_MCAN_TOCC_TOS_MASK		0x03
/** @defgroup mcan0_mcan_tocc_tos TOS Timeout Select
@{*/
/**@}*/

/** MCAN0_MCAN_TOCC_ETOC Enable Timeout Counter **/
#define MCAN0_MCAN_TOCC_ETOC		(1 << 0)

/**@}*/

/** @defgroup mcan0_mcan_tocv MCANTOCV Timeout Counter Value Register
@{*/


#define MCAN0_MCAN_TOCV_TOC_SHIFT		0
#define MCAN0_MCAN_TOCV_TOC_MASK		0xffff
/** @defgroup mcan0_mcan_tocv_toc TOC Timeout Counter (cleared on write)
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_ecr MCANECR Error Counter Register
@{*/


#define MCAN0_MCAN_ECR_CEL_SHIFT		16
#define MCAN0_MCAN_ECR_CEL_MASK		0xff
/** @defgroup mcan0_mcan_ecr_cel CEL CAN Error Logging (cleared on read)
@{*/
/**@}*/

