grevaillot/svd_tools/headers/ATSAMV71Q20/mcan0.h
/** MCAN0_MCAN_ECR_RP Receive Error Passive **/
#define MCAN0_MCAN_ECR_RP		(1 << 15)

#define MCAN0_MCAN_ECR_REC_SHIFT		8
#define MCAN0_MCAN_ECR_REC_MASK		0x7f
/** @defgroup mcan0_mcan_ecr_rec REC Receive Error Counter
@{*/
/**@}*/


#define MCAN0_MCAN_ECR_TEC_SHIFT		0
#define MCAN0_MCAN_ECR_TEC_MASK		0xff
/** @defgroup mcan0_mcan_ecr_tec TEC Transmit Error Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_psr MCANPSR Protocol Status Register
@{*/

/** MCAN0_MCAN_PSR_REDL Received a CAN FD Message (cleared on read) **/
#define MCAN0_MCAN_PSR_REDL		(1 << 13)
/** MCAN0_MCAN_PSR_RBRS BRS Flag of Last Received CAN FD Message (cleared on read) **/
#define MCAN0_MCAN_PSR_RBRS		(1 << 12)
/** MCAN0_MCAN_PSR_RESI ESI Flag of Last Received CAN FD Message (cleared on read) **/
#define MCAN0_MCAN_PSR_RESI		(1 << 11)

#define MCAN0_MCAN_PSR_FLEC_SHIFT		8
#define MCAN0_MCAN_PSR_FLEC_MASK		0x07
/** @defgroup mcan0_mcan_psr_flec FLEC Fast Last Error Code (set to 111 on read)
@{*/
/**@}*/

/** MCAN0_MCAN_PSR_BO Bus_Off Status **/
#define MCAN0_MCAN_PSR_BO		(1 << 7)
/** MCAN0_MCAN_PSR_EW Warning Status **/
#define MCAN0_MCAN_PSR_EW		(1 << 6)
/** MCAN0_MCAN_PSR_EP Error Passive **/
#define MCAN0_MCAN_PSR_EP		(1 << 5)

#define MCAN0_MCAN_PSR_ACT_SHIFT		3
#define MCAN0_MCAN_PSR_ACT_MASK		0x03
/** @defgroup mcan0_mcan_psr_act ACT Activity
@{*/
/**@}*/


#define MCAN0_MCAN_PSR_LEC_SHIFT		0
#define MCAN0_MCAN_PSR_LEC_MASK		0x07
/** @defgroup mcan0_mcan_psr_lec LEC Last Error Code (set to 111 on read)
@{*/
/**@}*/


/**@}*/

/** @defgroup mcan0_mcan_ir MCANIR Interrupt Register
@{*/

/** MCAN0_MCAN_IR_STE Stuff Error **/
#define MCAN0_MCAN_IR_STE		(1 << 31)
/** MCAN0_MCAN_IR_FOE Format Error **/
#define MCAN0_MCAN_IR_FOE		(1 << 30)
/** MCAN0_MCAN_IR_ACKE Acknowledge Error **/
#define MCAN0_MCAN_IR_ACKE		(1 << 29)
/** MCAN0_MCAN_IR_BE Bit Error **/
#define MCAN0_MCAN_IR_BE		(1 << 28)
/** MCAN0_MCAN_IR_CRCE CRC Error **/
#define MCAN0_MCAN_IR_CRCE		(1 << 27)
/** MCAN0_MCAN_IR_WDI Watchdog Interrupt **/
#define MCAN0_MCAN_IR_WDI		(1 << 26)
/** MCAN0_MCAN_IR_BO Bus_Off Status **/
#define MCAN0_MCAN_IR_BO		(1 << 25)
/** MCAN0_MCAN_IR_EW Warning Status **/
#define MCAN0_MCAN_IR_EW		(1 << 24)
/** MCAN0_MCAN_IR_EP Error Passive **/
#define MCAN0_MCAN_IR_EP		(1 << 23)
/** MCAN0_MCAN_IR_ELO Error Logging Overflow **/
#define MCAN0_MCAN_IR_ELO		(1 << 22)
/** MCAN0_MCAN_IR_BEU Bit Error Uncorrected **/
#define MCAN0_MCAN_IR_BEU		(1 << 21)
/** MCAN0_MCAN_IR_BEC Bit Error Corrected **/
#define MCAN0_MCAN_IR_BEC		(1 << 20)
/** MCAN0_MCAN_IR_DRX Message stored to Dedicated Receive Buffer **/
#define MCAN0_MCAN_IR_DRX		(1 << 19)
/** MCAN0_MCAN_IR_TOO Timeout Occurred **/
#define MCAN0_MCAN_IR_TOO		(1 << 18)
/** MCAN0_MCAN_IR_MRAF Message RAM Access Failure **/
#define MCAN0_MCAN_IR_MRAF		(1 << 17)
/** MCAN0_MCAN_IR_TSW Timestamp Wraparound **/
#define MCAN0_MCAN_IR_TSW		(1 << 16)
/** MCAN0_MCAN_IR_TEFL Tx Event FIFO Element Lost **/
#define MCAN0_MCAN_IR_TEFL		(1 << 15)
/** MCAN0_MCAN_IR_TEFF Tx Event FIFO Full **/
#define MCAN0_MCAN_IR_TEFF		(1 << 14)
/** MCAN0_MCAN_IR_TEFW Tx Event FIFO Watermark Reached **/
#define MCAN0_MCAN_IR_TEFW		(1 << 13)
/** MCAN0_MCAN_IR_TEFN Tx Event FIFO New Entry **/
#define MCAN0_MCAN_IR_TEFN		(1 << 12)
/** MCAN0_MCAN_IR_TFE Tx FIFO Empty **/
#define MCAN0_MCAN_IR_TFE		(1 << 11)
/** MCAN0_MCAN_IR_TCF Transmission Cancellation Finished **/
#define MCAN0_MCAN_IR_TCF		(1 << 10)
/** MCAN0_MCAN_IR_TC Transmission Completed **/
#define MCAN0_MCAN_IR_TC		(1 << 9)
/** MCAN0_MCAN_IR_HPM High Priority Message **/
#define MCAN0_MCAN_IR_HPM		(1 << 8)
/** MCAN0_MCAN_IR_RF1L Receive FIFO 1 Message Lost **/
#define MCAN0_MCAN_IR_RF1L		(1 << 7)
/** MCAN0_MCAN_IR_RF1F Receive FIFO 1 Full **/
#define MCAN0_MCAN_IR_RF1F		(1 << 6)
/** MCAN0_MCAN_IR_RF1W Receive FIFO 1 Watermark Reached **/
#define MCAN0_MCAN_IR_RF1W		(1 << 5)
/** MCAN0_MCAN_IR_RF1N Receive FIFO 1 New Message **/
#define MCAN0_MCAN_IR_RF1N		(1 << 4)
/** MCAN0_MCAN_IR_RF0L Receive FIFO 0 Message Lost **/
#define MCAN0_MCAN_IR_RF0L		(1 << 3)
/** MCAN0_MCAN_IR_RF0F Receive FIFO 0 Full **/
#define MCAN0_MCAN_IR_RF0F		(1 << 2)
/** MCAN0_MCAN_IR_RF0W Receive FIFO 0 Watermark Reached **/
#define MCAN0_MCAN_IR_RF0W		(1 << 1)
/** MCAN0_MCAN_IR_RF0N Receive FIFO 0 New Message **/
#define MCAN0_MCAN_IR_RF0N		(1 << 0)

/**@}*/

/** @defgroup mcan0_mcan_ie MCANIE Interrupt Enable Register
@{*/

/** MCAN0_MCAN_IE_STEE Stuff Error Interrupt Enable **/
#define MCAN0_MCAN_IE_STEE		(1 << 31)
/** MCAN0_MCAN_IE_FOEE Format Error Interrupt Enable **/
#define MCAN0_MCAN_IE_FOEE		(1 << 30)
/** MCAN0_MCAN_IE_ACKEE Acknowledge Error Interrupt Enable **/
#define MCAN0_MCAN_IE_ACKEE		(1 << 29)
/** MCAN0_MCAN_IE_BEE Bit Error Interrupt Enable **/
#define MCAN0_MCAN_IE_BEE		(1 << 28)
/** MCAN0_MCAN_IE_CRCEE CRC Error Interrupt Enable **/
#define MCAN0_MCAN_IE_CRCEE		(1 << 27)
/** MCAN0_MCAN_IE_WDIE Watchdog Interrupt Enable **/
#define MCAN0_MCAN_IE_WDIE		(1 << 26)
/** MCAN0_MCAN_IE_BOE Bus_Off Status Interrupt Enable **/
#define MCAN0_MCAN_IE_BOE		(1 << 25)
/** MCAN0_MCAN_IE_EWE Warning Status Interrupt Enable **/
#define MCAN0_MCAN_IE_EWE		(1 << 24)
/** MCAN0_MCAN_IE_EPE Error Passive Interrupt Enable **/
#define MCAN0_MCAN_IE_EPE		(1 << 23)
/** MCAN0_MCAN_IE_ELOE Error Logging Overflow Interrupt Enable **/
#define MCAN0_MCAN_IE_ELOE		(1 << 22)
/** MCAN0_MCAN_IE_BEUE Bit Error Uncorrected Interrupt Enable **/
#define MCAN0_MCAN_IE_BEUE		(1 << 21)
/** MCAN0_MCAN_IE_BECE Bit Error Corrected Interrupt Enable **/
#define MCAN0_MCAN_IE_BECE		(1 << 20)
/** MCAN0_MCAN_IE_DRXE Message stored to Dedicated Receive Buffer Interrupt Enable **/
#define MCAN0_MCAN_IE_DRXE		(1 << 19)
/** MCAN0_MCAN_IE_TOOE Timeout Occurred Interrupt Enable **/
#define MCAN0_MCAN_IE_TOOE		(1 << 18)
/** MCAN0_MCAN_IE_MRAFE Message RAM Access Failure Interrupt Enable **/
#define MCAN0_MCAN_IE_MRAFE		(1 << 17)
/** MCAN0_MCAN_IE_TSWE Timestamp Wraparound Interrupt Enable **/
#define MCAN0_MCAN_IE_TSWE		(1 << 16)
/** MCAN0_MCAN_IE_TEFLE Tx Event FIFO Event Lost Interrupt Enable **/
#define MCAN0_MCAN_IE_TEFLE		(1 << 15)
/** MCAN0_MCAN_IE_TEFFE Tx Event FIFO Full Interrupt Enable **/
#define MCAN0_MCAN_IE_TEFFE		(1 << 14)
/** MCAN0_MCAN_IE_TEFWE Tx Event FIFO Watermark Reached Interrupt Enable **/
#define MCAN0_MCAN_IE_TEFWE		(1 << 13)
/** MCAN0_MCAN_IE_TEFNE Tx Event FIFO New Entry Interrupt Enable **/
#define MCAN0_MCAN_IE_TEFNE		(1 << 12)
/** MCAN0_MCAN_IE_TFEE Tx FIFO Empty Interrupt Enable **/
#define MCAN0_MCAN_IE_TFEE		(1 << 11)
/** MCAN0_MCAN_IE_TCFE Transmission Cancellation Finished Interrupt Enable **/
#define MCAN0_MCAN_IE_TCFE		(1 << 10)
/** MCAN0_MCAN_IE_TCE Transmission Completed Interrupt Enable **/
#define MCAN0_MCAN_IE_TCE		(1 << 9)
/** MCAN0_MCAN_IE_HPME High Priority Message Interrupt Enable **/
#define MCAN0_MCAN_IE_HPME		(1 << 8)
/** MCAN0_MCAN_IE_RF1LE Receive FIFO 1 Message Lost Interrupt Enable **/
#define MCAN0_MCAN_IE_RF1LE		(1 << 7)
/** MCAN0_MCAN_IE_RF1FE Receive FIFO 1 Full Interrupt Enable **/
#define MCAN0_MCAN_IE_RF1FE		(1 << 6)
/** MCAN0_MCAN_IE_RF1WE Receive FIFO 1 Watermark Reached Interrupt Enable **/
#define MCAN0_MCAN_IE_RF1WE		(1 << 5)
/** MCAN0_MCAN_IE_RF1NE Receive FIFO 1 New Message Interrupt Enable **/
#define MCAN0_MCAN_IE_RF1NE		(1 << 4)
/** MCAN0_MCAN_IE_RF0LE Receive FIFO 0 Message Lost Interrupt Enable **/
#define MCAN0_MCAN_IE_RF0LE		(1 << 3)
/** MCAN0_MCAN_IE_RF0FE Receive FIFO 0 Full Interrupt Enable **/
#define MCAN0_MCAN_IE_RF0FE		(1 << 2)
/** MCAN0_MCAN_IE_RF0WE Receive FIFO 0 Watermark Reached Interrupt Enable **/
#define MCAN0_MCAN_IE_RF0WE		(1 << 1)
/** MCAN0_MCAN_IE_RF0NE Receive FIFO 0 New Message Interrupt Enable **/
#define MCAN0_MCAN_IE_RF0NE		(1 << 0)

/**@}*/

/** @defgroup mcan0_mcan_ils MCANILS Interrupt Line Select Register
@{*/

/** MCAN0_MCAN_ILS_STEL Stuff Error Interrupt Line **/
#define MCAN0_MCAN_ILS_STEL		(1 << 31)
/** MCAN0_MCAN_ILS_FOEL Format Error Interrupt Line **/
#define MCAN0_MCAN_ILS_FOEL		(1 << 30)
/** MCAN0_MCAN_ILS_ACKEL Acknowledge Error Interrupt Line **/
#define MCAN0_MCAN_ILS_ACKEL		(1 << 29)
/** MCAN0_MCAN_ILS_BEL Bit Error Interrupt Line **/
#define MCAN0_MCAN_ILS_BEL		(1 << 28)
/** MCAN0_MCAN_ILS_CRCEL CRC Error Interrupt Line **/
#define MCAN0_MCAN_ILS_CRCEL		(1 << 27)
/** MCAN0_MCAN_ILS_WDIL Watchdog Interrupt Line **/
#define MCAN0_MCAN_ILS_WDIL		(1 << 26)
/** MCAN0_MCAN_ILS_BOL Bus_Off Status Interrupt Line **/
#define MCAN0_MCAN_ILS_BOL		(1 << 25)
/** MCAN0_MCAN_ILS_EWL Warning Status Interrupt Line **/
#define MCAN0_MCAN_ILS_EWL		(1 << 24)
/** MCAN0_MCAN_ILS_EPL Error Passive Interrupt Line **/
#define MCAN0_MCAN_ILS_EPL		(1 << 23)
/** MCAN0_MCAN_ILS_ELOL Error Logging Overflow Interrupt Line **/
#define MCAN0_MCAN_ILS_ELOL		(1 << 22)
/** MCAN0_MCAN_ILS_BEUL Bit Error Uncorrected Interrupt Line **/
#define MCAN0_MCAN_ILS_BEUL		(1 << 21)
/** MCAN0_MCAN_ILS_BECL Bit Error Corrected Interrupt Line **/
#define MCAN0_MCAN_ILS_BECL		(1 << 20)
/** MCAN0_MCAN_ILS_DRXL Message stored to Dedicated Receive Buffer Interrupt Line **/
#define MCAN0_MCAN_ILS_DRXL		(1 << 19)
/** MCAN0_MCAN_ILS_TOOL Timeout Occurred Interrupt Line **/
#define MCAN0_MCAN_ILS_TOOL		(1 << 18)
/** MCAN0_MCAN_ILS_MRAFL Message RAM Access Failure Interrupt Line **/
#define MCAN0_MCAN_ILS_MRAFL		(1 << 17)
/** MCAN0_MCAN_ILS_TSWL Timestamp Wraparound Interrupt Line **/
#define MCAN0_MCAN_ILS_TSWL		(1 << 16)
/** MCAN0_MCAN_ILS_TEFLL Tx Event FIFO Event Lost Interrupt Line **/
#define MCAN0_MCAN_ILS_TEFLL		(1 << 15)
/** MCAN0_MCAN_ILS_TEFFL Tx Event FIFO Full Interrupt Line **/
#define MCAN0_MCAN_ILS_TEFFL		(1 << 14)
/** MCAN0_MCAN_ILS_TEFWL Tx Event FIFO Watermark Reached Interrupt Line **/
#define MCAN0_MCAN_ILS_TEFWL		(1 << 13)
/** MCAN0_MCAN_ILS_TEFNL Tx Event FIFO New Entry Interrupt Line **/
#define MCAN0_MCAN_ILS_TEFNL		(1 << 12)
/** MCAN0_MCAN_ILS_TFEL Tx FIFO Empty Interrupt Line **/
#define MCAN0_MCAN_ILS_TFEL		(1 << 11)
/** MCAN0_MCAN_ILS_TCFL Transmission Cancellation Finished Interrupt Line **/
#define MCAN0_MCAN_ILS_TCFL		(1 << 10)
/** MCAN0_MCAN_ILS_TCL Transmission Completed Interrupt Line **/
#define MCAN0_MCAN_ILS_TCL		(1 << 9)
/** MCAN0_MCAN_ILS_HPML High Priority Message Interrupt Line **/
#define MCAN0_MCAN_ILS_HPML		(1 << 8)
/** MCAN0_MCAN_ILS_RF1LL Receive FIFO 1 Message Lost Interrupt Line **/
#define MCAN0_MCAN_ILS_RF1LL		(1 << 7)
/** MCAN0_MCAN_ILS_RF1FL Receive FIFO 1 Full Interrupt Line **/
#define MCAN0_MCAN_ILS_RF1FL		(1 << 6)
/** MCAN0_MCAN_ILS_RF1WL Receive FIFO 1 Watermark Reached Interrupt Line **/
#define MCAN0_MCAN_ILS_RF1WL		(1 << 5)
/** MCAN0_MCAN_ILS_RF1NL Receive FIFO 1 New Message Interrupt Line **/
#define MCAN0_MCAN_ILS_RF1NL		(1 << 4)
/** MCAN0_MCAN_ILS_RF0LL Receive FIFO 0 Message Lost Interrupt Line **/
#define MCAN0_MCAN_ILS_RF0LL		(1 << 3)
/** MCAN0_MCAN_ILS_RF0FL Receive FIFO 0 Full Interrupt Line **/
#define MCAN0_MCAN_ILS_RF0FL		(1 << 2)
/** MCAN0_MCAN_ILS_RF0WL Receive FIFO 0 Watermark Reached Interrupt Line **/
#define MCAN0_MCAN_ILS_RF0WL		(1 << 1)
/** MCAN0_MCAN_ILS_RF0NL Receive FIFO 0 New Message Interrupt Line **/
#define MCAN0_MCAN_ILS_RF0NL		(1 << 0)

/**@}*/

