grevaillot/svd_tools/headers/ATSAMV71Q20/mcan0.h
/** MCAN0_MCAN_TXBTIE_TIE31 Transmission Interrupt Enable for Buffer 31 **/
#define MCAN0_MCAN_TXBTIE_TIE31		(1 << 31)
/** MCAN0_MCAN_TXBTIE_TIE30 Transmission Interrupt Enable for Buffer 30 **/
#define MCAN0_MCAN_TXBTIE_TIE30		(1 << 30)
/** MCAN0_MCAN_TXBTIE_TIE29 Transmission Interrupt Enable for Buffer 29 **/
#define MCAN0_MCAN_TXBTIE_TIE29		(1 << 29)
/** MCAN0_MCAN_TXBTIE_TIE28 Transmission Interrupt Enable for Buffer 28 **/
#define MCAN0_MCAN_TXBTIE_TIE28		(1 << 28)
/** MCAN0_MCAN_TXBTIE_TIE27 Transmission Interrupt Enable for Buffer 27 **/
#define MCAN0_MCAN_TXBTIE_TIE27		(1 << 27)
/** MCAN0_MCAN_TXBTIE_TIE26 Transmission Interrupt Enable for Buffer 26 **/
#define MCAN0_MCAN_TXBTIE_TIE26		(1 << 26)
/** MCAN0_MCAN_TXBTIE_TIE25 Transmission Interrupt Enable for Buffer 25 **/
#define MCAN0_MCAN_TXBTIE_TIE25		(1 << 25)
/** MCAN0_MCAN_TXBTIE_TIE24 Transmission Interrupt Enable for Buffer 24 **/
#define MCAN0_MCAN_TXBTIE_TIE24		(1 << 24)
/** MCAN0_MCAN_TXBTIE_TIE23 Transmission Interrupt Enable for Buffer 23 **/
#define MCAN0_MCAN_TXBTIE_TIE23		(1 << 23)
/** MCAN0_MCAN_TXBTIE_TIE22 Transmission Interrupt Enable for Buffer 22 **/
#define MCAN0_MCAN_TXBTIE_TIE22		(1 << 22)
/** MCAN0_MCAN_TXBTIE_TIE21 Transmission Interrupt Enable for Buffer 21 **/
#define MCAN0_MCAN_TXBTIE_TIE21		(1 << 21)
/** MCAN0_MCAN_TXBTIE_TIE20 Transmission Interrupt Enable for Buffer 20 **/
#define MCAN0_MCAN_TXBTIE_TIE20		(1 << 20)
/** MCAN0_MCAN_TXBTIE_TIE19 Transmission Interrupt Enable for Buffer 19 **/
#define MCAN0_MCAN_TXBTIE_TIE19		(1 << 19)
/** MCAN0_MCAN_TXBTIE_TIE18 Transmission Interrupt Enable for Buffer 18 **/
#define MCAN0_MCAN_TXBTIE_TIE18		(1 << 18)
/** MCAN0_MCAN_TXBTIE_TIE17 Transmission Interrupt Enable for Buffer 17 **/
#define MCAN0_MCAN_TXBTIE_TIE17		(1 << 17)
/** MCAN0_MCAN_TXBTIE_TIE16 Transmission Interrupt Enable for Buffer 16 **/
#define MCAN0_MCAN_TXBTIE_TIE16		(1 << 16)
/** MCAN0_MCAN_TXBTIE_TIE15 Transmission Interrupt Enable for Buffer 15 **/
#define MCAN0_MCAN_TXBTIE_TIE15		(1 << 15)
/** MCAN0_MCAN_TXBTIE_TIE14 Transmission Interrupt Enable for Buffer 14 **/
#define MCAN0_MCAN_TXBTIE_TIE14		(1 << 14)
/** MCAN0_MCAN_TXBTIE_TIE13 Transmission Interrupt Enable for Buffer 13 **/
#define MCAN0_MCAN_TXBTIE_TIE13		(1 << 13)
/** MCAN0_MCAN_TXBTIE_TIE12 Transmission Interrupt Enable for Buffer 12 **/
#define MCAN0_MCAN_TXBTIE_TIE12		(1 << 12)
/** MCAN0_MCAN_TXBTIE_TIE11 Transmission Interrupt Enable for Buffer 11 **/
#define MCAN0_MCAN_TXBTIE_TIE11		(1 << 11)
/** MCAN0_MCAN_TXBTIE_TIE10 Transmission Interrupt Enable for Buffer 10 **/
#define MCAN0_MCAN_TXBTIE_TIE10		(1 << 10)
/** MCAN0_MCAN_TXBTIE_TIE9 Transmission Interrupt Enable for Buffer 9 **/
#define MCAN0_MCAN_TXBTIE_TIE9		(1 << 9)
/** MCAN0_MCAN_TXBTIE_TIE8 Transmission Interrupt Enable for Buffer 8 **/
#define MCAN0_MCAN_TXBTIE_TIE8		(1 << 8)
/** MCAN0_MCAN_TXBTIE_TIE7 Transmission Interrupt Enable for Buffer 7 **/
#define MCAN0_MCAN_TXBTIE_TIE7		(1 << 7)
/** MCAN0_MCAN_TXBTIE_TIE6 Transmission Interrupt Enable for Buffer 6 **/
#define MCAN0_MCAN_TXBTIE_TIE6		(1 << 6)
/** MCAN0_MCAN_TXBTIE_TIE5 Transmission Interrupt Enable for Buffer 5 **/
#define MCAN0_MCAN_TXBTIE_TIE5		(1 << 5)
/** MCAN0_MCAN_TXBTIE_TIE4 Transmission Interrupt Enable for Buffer 4 **/
#define MCAN0_MCAN_TXBTIE_TIE4		(1 << 4)
/** MCAN0_MCAN_TXBTIE_TIE3 Transmission Interrupt Enable for Buffer 3 **/
#define MCAN0_MCAN_TXBTIE_TIE3		(1 << 3)
/** MCAN0_MCAN_TXBTIE_TIE2 Transmission Interrupt Enable for Buffer 2 **/
#define MCAN0_MCAN_TXBTIE_TIE2		(1 << 2)
/** MCAN0_MCAN_TXBTIE_TIE1 Transmission Interrupt Enable for Buffer 1 **/
#define MCAN0_MCAN_TXBTIE_TIE1		(1 << 1)
/** MCAN0_MCAN_TXBTIE_TIE0 Transmission Interrupt Enable for Buffer 0 **/
#define MCAN0_MCAN_TXBTIE_TIE0		(1 << 0)

/**@}*/

/** @defgroup mcan0_mcan_txbcie MCANTXBCIE Transmit Buffer Cancellation Finished Interrupt Enable Register
@{*/

/** MCAN0_MCAN_TXBCIE_CFIE31 Cancellation Finished Interrupt Enable for Transmit Buffer 31 **/
#define MCAN0_MCAN_TXBCIE_CFIE31		(1 << 31)
/** MCAN0_MCAN_TXBCIE_CFIE30 Cancellation Finished Interrupt Enable for Transmit Buffer 30 **/
#define MCAN0_MCAN_TXBCIE_CFIE30		(1 << 30)
/** MCAN0_MCAN_TXBCIE_CFIE29 Cancellation Finished Interrupt Enable for Transmit Buffer 29 **/
#define MCAN0_MCAN_TXBCIE_CFIE29		(1 << 29)
/** MCAN0_MCAN_TXBCIE_CFIE28 Cancellation Finished Interrupt Enable for Transmit Buffer 28 **/
#define MCAN0_MCAN_TXBCIE_CFIE28		(1 << 28)
/** MCAN0_MCAN_TXBCIE_CFIE27 Cancellation Finished Interrupt Enable for Transmit Buffer 27 **/
#define MCAN0_MCAN_TXBCIE_CFIE27		(1 << 27)
/** MCAN0_MCAN_TXBCIE_CFIE26 Cancellation Finished Interrupt Enable for Transmit Buffer 26 **/
#define MCAN0_MCAN_TXBCIE_CFIE26		(1 << 26)
/** MCAN0_MCAN_TXBCIE_CFIE25 Cancellation Finished Interrupt Enable for Transmit Buffer 25 **/
#define MCAN0_MCAN_TXBCIE_CFIE25		(1 << 25)
/** MCAN0_MCAN_TXBCIE_CFIE24 Cancellation Finished Interrupt Enable for Transmit Buffer 24 **/
#define MCAN0_MCAN_TXBCIE_CFIE24		(1 << 24)
/** MCAN0_MCAN_TXBCIE_CFIE23 Cancellation Finished Interrupt Enable for Transmit Buffer 23 **/
#define MCAN0_MCAN_TXBCIE_CFIE23		(1 << 23)
/** MCAN0_MCAN_TXBCIE_CFIE22 Cancellation Finished Interrupt Enable for Transmit Buffer 22 **/
#define MCAN0_MCAN_TXBCIE_CFIE22		(1 << 22)
/** MCAN0_MCAN_TXBCIE_CFIE21 Cancellation Finished Interrupt Enable for Transmit Buffer 21 **/
#define MCAN0_MCAN_TXBCIE_CFIE21		(1 << 21)
/** MCAN0_MCAN_TXBCIE_CFIE20 Cancellation Finished Interrupt Enable for Transmit Buffer 20 **/
#define MCAN0_MCAN_TXBCIE_CFIE20		(1 << 20)
/** MCAN0_MCAN_TXBCIE_CFIE19 Cancellation Finished Interrupt Enable for Transmit Buffer 19 **/
#define MCAN0_MCAN_TXBCIE_CFIE19		(1 << 19)
/** MCAN0_MCAN_TXBCIE_CFIE18 Cancellation Finished Interrupt Enable for Transmit Buffer 18 **/
#define MCAN0_MCAN_TXBCIE_CFIE18		(1 << 18)
/** MCAN0_MCAN_TXBCIE_CFIE17 Cancellation Finished Interrupt Enable for Transmit Buffer 17 **/
#define MCAN0_MCAN_TXBCIE_CFIE17		(1 << 17)
/** MCAN0_MCAN_TXBCIE_CFIE16 Cancellation Finished Interrupt Enable for Transmit Buffer 16 **/
#define MCAN0_MCAN_TXBCIE_CFIE16		(1 << 16)
/** MCAN0_MCAN_TXBCIE_CFIE15 Cancellation Finished Interrupt Enable for Transmit Buffer 15 **/
#define MCAN0_MCAN_TXBCIE_CFIE15		(1 << 15)
/** MCAN0_MCAN_TXBCIE_CFIE14 Cancellation Finished Interrupt Enable for Transmit Buffer 14 **/
#define MCAN0_MCAN_TXBCIE_CFIE14		(1 << 14)
/** MCAN0_MCAN_TXBCIE_CFIE13 Cancellation Finished Interrupt Enable for Transmit Buffer 13 **/
#define MCAN0_MCAN_TXBCIE_CFIE13		(1 << 13)
/** MCAN0_MCAN_TXBCIE_CFIE12 Cancellation Finished Interrupt Enable for Transmit Buffer 12 **/
#define MCAN0_MCAN_TXBCIE_CFIE12		(1 << 12)
/** MCAN0_MCAN_TXBCIE_CFIE11 Cancellation Finished Interrupt Enable for Transmit Buffer 11 **/
#define MCAN0_MCAN_TXBCIE_CFIE11		(1 << 11)
/** MCAN0_MCAN_TXBCIE_CFIE10 Cancellation Finished Interrupt Enable for Transmit Buffer 10 **/
#define MCAN0_MCAN_TXBCIE_CFIE10		(1 << 10)
/** MCAN0_MCAN_TXBCIE_CFIE9 Cancellation Finished Interrupt Enable for Transmit Buffer 9 **/
#define MCAN0_MCAN_TXBCIE_CFIE9		(1 << 9)
/** MCAN0_MCAN_TXBCIE_CFIE8 Cancellation Finished Interrupt Enable for Transmit Buffer 8 **/
#define MCAN0_MCAN_TXBCIE_CFIE8		(1 << 8)
/** MCAN0_MCAN_TXBCIE_CFIE7 Cancellation Finished Interrupt Enable for Transmit Buffer 7 **/
#define MCAN0_MCAN_TXBCIE_CFIE7		(1 << 7)
/** MCAN0_MCAN_TXBCIE_CFIE6 Cancellation Finished Interrupt Enable for Transmit Buffer 6 **/
#define MCAN0_MCAN_TXBCIE_CFIE6		(1 << 6)
/** MCAN0_MCAN_TXBCIE_CFIE5 Cancellation Finished Interrupt Enable for Transmit Buffer 5 **/
#define MCAN0_MCAN_TXBCIE_CFIE5		(1 << 5)
/** MCAN0_MCAN_TXBCIE_CFIE4 Cancellation Finished Interrupt Enable for Transmit Buffer 4 **/
#define MCAN0_MCAN_TXBCIE_CFIE4		(1 << 4)
/** MCAN0_MCAN_TXBCIE_CFIE3 Cancellation Finished Interrupt Enable for Transmit Buffer 3 **/
#define MCAN0_MCAN_TXBCIE_CFIE3		(1 << 3)
/** MCAN0_MCAN_TXBCIE_CFIE2 Cancellation Finished Interrupt Enable for Transmit Buffer 2 **/
#define MCAN0_MCAN_TXBCIE_CFIE2		(1 << 2)
/** MCAN0_MCAN_TXBCIE_CFIE1 Cancellation Finished Interrupt Enable for Transmit Buffer 1 **/
#define MCAN0_MCAN_TXBCIE_CFIE1		(1 << 1)
/** MCAN0_MCAN_TXBCIE_CFIE0 Cancellation Finished Interrupt Enable for Transmit Buffer 0 **/
#define MCAN0_MCAN_TXBCIE_CFIE0		(1 << 0)

/**@}*/

